; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=375, out_folder=htg/blocksworld/training, instance_id=85, seed=2109, goal_proportion=0.03

(define (problem blocksworld-85)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 b319 b320 b321 b322 b323 b324 b325 b326 b327 b328 b329 b330 b331 b332 b333 b334 b335 b336 b337 b338 b339 b340 b341 b342 b343 b344 b345 b346 b347 b348 b349 b350 b351 b352 b353 b354 b355 b356 b357 b358 b359 b360 b361 b362 b363 b364 b365 b366 b367 b368 b369 b370 b371 b372 b373 b374 b375 - object)
 (:init 
    (arm-empty)
    (clear b234)
    (on b234 b216)
    (on-table b216)
    (clear b274)
    (on b274 b272)
    (on b272 b317)
    (on b317 b109)
    (on b109 b243)
    (on b243 b134)
    (on b134 b354)
    (on b354 b20)
    (on b20 b251)
    (on b251 b76)
    (on-table b76)
    (clear b344)
    (on-table b344)
    (clear b149)
    (on-table b149)
    (clear b290)
    (on-table b290)
    (clear b267)
    (on b267 b103)
    (on b103 b79)
    (on b79 b316)
    (on b316 b75)
    (on b75 b275)
    (on b275 b210)
    (on b210 b201)
    (on b201 b369)
    (on b369 b268)
    (on b268 b338)
    (on b338 b88)
    (on b88 b118)
    (on-table b118)
    (clear b138)
    (on b138 b221)
    (on b221 b289)
    (on b289 b17)
    (on b17 b327)
    (on-table b327)
    (clear b186)
    (on-table b186)
    (clear b213)
    (on b213 b107)
    (on b107 b189)
    (on b189 b247)
    (on-table b247)
    (clear b73)
    (on b73 b214)
    (on b214 b291)
    (on b291 b183)
    (on b183 b86)
    (on-table b86)
    (clear b209)
    (on b209 b125)
    (on b125 b120)
    (on b120 b345)
    (on b345 b72)
    (on b72 b160)
    (on b160 b339)
    (on b339 b162)
    (on-table b162)
    (clear b28)
    (on b28 b314)
    (on b314 b355)
    (on b355 b129)
    (on-table b129)
    (clear b299)
    (on b299 b58)
    (on b58 b321)
    (on-table b321)
    (clear b225)
    (on b225 b33)
    (on b33 b82)
    (on b82 b253)
    (on b253 b137)
    (on b137 b144)
    (on b144 b375)
    (on b375 b1)
    (on b1 b104)
    (on b104 b102)
    (on-table b102)
    (clear b172)
    (on b172 b59)
    (on-table b59)
    (clear b106)
    (on b106 b46)
    (on-table b46)
    (clear b119)
    (on b119 b341)
    (on b341 b154)
    (on b154 b47)
    (on b47 b367)
    (on b367 b187)
    (on b187 b331)
    (on b331 b170)
    (on-table b170)
    (clear b48)
    (on-table b48)
    (clear b364)
    (on b364 b97)
    (on b97 b19)
    (on b19 b304)
    (on b304 b323)
    (on b323 b122)
    (on b122 b348)
    (on b348 b40)
    (on b40 b254)
    (on b254 b13)
    (on b13 b16)
    (on b16 b293)
    (on b293 b36)
    (on-table b36)
    (clear b3)
    (on b3 b319)
    (on b319 b81)
    (on b81 b100)
    (on b100 b301)
    (on-table b301)
    (clear b371)
    (on b371 b177)
    (on b177 b238)
    (on b238 b258)
    (on b258 b14)
    (on b14 b257)
    (on b257 b117)
    (on b117 b85)
    (on b85 b227)
    (on-table b227)
    (clear b370)
    (on b370 b245)
    (on-table b245)
    (clear b173)
    (on b173 b333)
    (on b333 b8)
    (on b8 b269)
    (on-table b269)
    (clear b205)
    (on b205 b220)
    (on b220 b328)
    (on-table b328)
    (clear b266)
    (on-table b266)
    (clear b108)
    (on b108 b302)
    (on b302 b329)
    (on b329 b273)
    (on b273 b23)
    (on-table b23)
    (clear b128)
    (on b128 b174)
    (on b174 b362)
    (on-table b362)
    (clear b18)
    (on-table b18)
    (clear b202)
    (on b202 b182)
    (on b182 b236)
    (on b236 b150)
    (on-table b150)
    (clear b32)
    (on b32 b232)
    (on b232 b179)
    (on b179 b49)
    (on b49 b342)
    (on b342 b217)
    (on b217 b105)
    (on b105 b29)
    (on b29 b124)
    (on-table b124)
    (clear b305)
    (on-table b305)
    (clear b240)
    (on-table b240)
    (clear b363)
    (on-table b363)
    (clear b139)
    (on-table b139)
    (clear b181)
    (on b181 b68)
    (on b68 b69)
    (on b69 b219)
    (on b219 b148)
    (on-table b148)
    (clear b212)
    (on b212 b347)
    (on b347 b261)
    (on b261 b241)
    (on b241 b111)
    (on b111 b284)
    (on-table b284)
    (clear b93)
    (on-table b93)
    (clear b101)
    (on b101 b365)
    (on b365 b96)
    (on b96 b185)
    (on b185 b300)
    (on b300 b318)
    (on-table b318)
    (clear b233)
    (on-table b233)
    (clear b298)
    (on b298 b6)
    (on-table b6)
    (clear b43)
    (on-table b43)
    (clear b226)
    (on b226 b41)
    (on b41 b197)
    (on b197 b356)
    (on b356 b110)
    (on b110 b53)
    (on b53 b153)
    (on-table b153)
    (clear b239)
    (on b239 b287)
    (on b287 b350)
    (on-table b350)
    (clear b310)
    (on b310 b190)
    (on-table b190)
    (clear b351)
    (on b351 b38)
    (on b38 b326)
    (on b326 b123)
    (on b123 b297)
    (on b297 b242)
    (on b242 b188)
    (on b188 b198)
    (on b198 b78)
    (on-table b78)
    (clear b237)
    (on b237 b312)
    (on-table b312)
    (clear b229)
    (on b229 b130)
    (on b130 b352)
    (on b352 b65)
    (on b65 b306)
    (on b306 b127)
    (on b127 b34)
    (on b34 b194)
    (on b194 b246)
    (on b246 b218)
    (on-table b218)
    (clear b168)
    (on b168 b151)
    (on b151 b115)
    (on b115 b256)
    (on-table b256)
    (clear b131)
    (on-table b131)
    (clear b336)
    (on b336 b208)
    (on-table b208)
    (clear b50)
    (on b50 b159)
    (on b159 b255)
    (on b255 b143)
    (on b143 b64)
    (on-table b64)
    (clear b54)
    (on-table b54)
    (clear b374)
    (on b374 b361)
    (on b361 b89)
    (on b89 b358)
    (on b358 b250)
    (on b250 b56)
    (on b56 b215)
    (on b215 b126)
    (on b126 b195)
    (on b195 b61)
    (on-table b61)
    (clear b286)
    (on-table b286)
    (clear b228)
    (on b228 b264)
    (on b264 b360)
    (on-table b360)
    (clear b311)
    (on-table b311)
    (clear b77)
    (on b77 b156)
    (on b156 b193)
    (on b193 b184)
    (on b184 b308)
    (on b308 b224)
    (on b224 b95)
    (on b95 b368)
    (on b368 b5)
    (on b5 b31)
    (on b31 b325)
    (on-table b325)
    (clear b155)
    (on b155 b10)
    (on-table b10)
    (clear b87)
    (on b87 b320)
    (on b320 b94)
    (on b94 b24)
    (on-table b24)
    (clear b283)
    (on b283 b164)
    (on-table b164)
    (clear b282)
    (on b282 b337)
    (on b337 b27)
    (on b27 b84)
    (on b84 b133)
    (on b133 b276)
    (on b276 b2)
    (on b2 b372)
    (on b372 b70)
    (on b70 b35)
    (on b35 b74)
    (on b74 b211)
    (on b211 b315)
    (on b315 b235)
    (on b235 b21)
    (on b21 b359)
    (on b359 b357)
    (on b357 b113)
    (on-table b113)
    (clear b322)
    (on b322 b262)
    (on b262 b62)
    (on b62 b116)
    (on b116 b260)
    (on b260 b335)
    (on b335 b343)
    (on b343 b324)
    (on b324 b263)
    (on b263 b114)
    (on b114 b366)
    (on-table b366)
    (clear b9)
    (on b9 b63)
    (on b63 b136)
    (on b136 b294)
    (on b294 b67)
    (on b67 b230)
    (on-table b230)
    (clear b146)
    (on b146 b42)
    (on b42 b307)
    (on b307 b199)
    (on b199 b25)
    (on b25 b200)
    (on b200 b349)
    (on b349 b57)
    (on-table b57)
    (clear b80)
    (on b80 b60)
    (on b60 b332)
    (on-table b332)
    (clear b373)
    (on b373 b196)
    (on b196 b191)
    (on b191 b222)
    (on b222 b135)
    (on b135 b11)
    (on b11 b90)
    (on-table b90)
    (clear b44)
    (on b44 b26)
    (on b26 b281)
    (on-table b281)
    (clear b158)
    (on b158 b30)
    (on b30 b152)
    (on b152 b157)
    (on-table b157)
    (clear b353)
    (on b353 b270)
    (on b270 b280)
    (on b280 b277)
    (on-table b277)
    (clear b169)
    (on-table b169)
    (clear b147)
    (on-table b147)
    (clear b249)
    (on-table b249)
    (clear b340)
    (on-table b340)
    (clear b4)
    (on b4 b141)
    (on b141 b12)
    (on b12 b178)
    (on b178 b285)
    (on b285 b334)
    (on b334 b92)
    (on b92 b231)
    (on b231 b265)
    (on b265 b132)
    (on-table b132)
    (clear b206)
    (on-table b206)
    (clear b91)
    (on b91 b83)
    (on b83 b165)
    (on b165 b288)
    (on b288 b204)
    (on b204 b167)
    (on b167 b171)
    (on-table b171)
    (clear b66)
    (on b66 b292)
    (on-table b292)
    (clear b192)
    (on b192 b303)
    (on-table b303)
    (clear b330)
    (on b330 b248)
    (on b248 b309)
    (on-table b309)
    (clear b7)
    (on b7 b252)
    (on b252 b52)
    (on b52 b39)
    (on-table b39)
    (clear b37)
    (on b37 b163)
    (on-table b163)
    (clear b271)
    (on b271 b140)
    (on b140 b15)
    (on b15 b145)
    (on b145 b51)
    (on b51 b121)
    (on b121 b296)
    (on b296 b259)
    (on b259 b71)
    (on b71 b175)
    (on-table b175)
    (clear b279)
    (on b279 b313)
    (on b313 b45)
    (on b45 b112)
    (on-table b112)
    (clear b176)
    (on b176 b295)
    (on-table b295)
    (clear b98)
    (on-table b98)
    (clear b180)
    (on b180 b207)
    (on b207 b142)
    (on b142 b99)
    (on b99 b55)
    (on b55 b244)
    (on b244 b166)
    (on b166 b22)
    (on b22 b346)
    (on b346 b161)
    (on b161 b223)
    (on b223 b278)
    (on b278 b203)
    (on-table b203))
 (:goal  (and 
    (clear b7)
    (on b7 b3)
    (on-table b3)
    (clear b11)
    (on b11 b5)
    (on b5 b1)
    (on b1 b2)
    (on b2 b8)
    (on b8 b10)
    (on b10 b6)
    (on b6 b4)
    (on b4 b9)
    (on-table b9))))

; plan
1. (unstack b3 b319)
   deleted: (on b3 b319) (clear b3) (arm-empty)
   added: (holding b3) (clear b319)
   goals met: 1 of 13
2. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 2 of 13
3. (unstack b9 b63)
   deleted: (on b9 b63) (clear b9) (arm-empty)
   added: (holding b9) (clear b63)
   goals met: 2 of 13
4. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 3 of 13
5. (unstack b155 b10)
   deleted: (on b155 b10) (clear b155) (arm-empty)
   added: (holding b155) (clear b10)
   goals met: 3 of 13
6. (putdown b155)
   deleted: (holding b155)
   added: (clear b155) (arm-empty) (on-table b155)
   goals met: 3 of 13
7. (unstack b173 b333)
   deleted: (on b173 b333) (clear b173) (arm-empty)
   added: (holding b173) (clear b333)
   goals met: 3 of 13
8. (putdown b173)
   deleted: (holding b173)
   added: (clear b173) (arm-empty) (on-table b173)
   goals met: 3 of 13
9. (unstack b225 b33)
   deleted: (on b225 b33) (clear b225) (arm-empty)
   added: (holding b225) (clear b33)
   goals met: 3 of 13
10. (putdown b225)
   deleted: (holding b225)
   added: (clear b225) (arm-empty) (on-table b225)
   goals met: 3 of 13
11. (unstack b282 b337)
   deleted: (on b282 b337) (clear b282) (arm-empty)
   added: (holding b282) (clear b337)
   goals met: 3 of 13
12. (putdown b282)
   deleted: (holding b282)
   added: (clear b282) (arm-empty) (on-table b282)
   goals met: 3 of 13
13. (unstack b298 b6)
   deleted: (on b298 b6) (clear b298) (arm-empty)
   added: (holding b298) (clear b6)
   goals met: 3 of 13
14. (putdown b298)
   deleted: (holding b298)
   added: (clear b298) (arm-empty) (on-table b298)
   goals met: 3 of 13
15. (unstack b33 b82)
   deleted: (on b33 b82) (clear b33) (arm-empty)
   added: (holding b33) (clear b82)
   goals met: 3 of 13
16. (putdown b33)
   deleted: (holding b33)
   added: (clear b33) (arm-empty) (on-table b33)
   goals met: 3 of 13
17. (unstack b333 b8)
   deleted: (on b333 b8) (clear b333) (arm-empty)
   added: (holding b333) (clear b8)
   goals met: 3 of 13
18. (putdown b333)
   deleted: (holding b333)
   added: (clear b333) (arm-empty) (on-table b333)
   goals met: 3 of 13
19. (unstack b337 b27)
   deleted: (on b337 b27) (clear b337) (arm-empty)
   added: (holding b337) (clear b27)
   goals met: 3 of 13
20. (putdown b337)
   deleted: (holding b337)
   added: (clear b337) (arm-empty) (on-table b337)
   goals met: 3 of 13
21. (unstack b27 b84)
   deleted: (on b27 b84) (clear b27) (arm-empty)
   added: (holding b27) (clear b84)
   goals met: 3 of 13
22. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 3 of 13
23. (unstack b373 b196)
   deleted: (on b373 b196) (clear b373) (arm-empty)
   added: (holding b373) (clear b196)
   goals met: 3 of 13
24. (putdown b373)
   deleted: (holding b373)
   added: (clear b373) (arm-empty) (on-table b373)
   goals met: 3 of 13
25. (unstack b196 b191)
   deleted: (on b196 b191) (clear b196) (arm-empty)
   added: (holding b196) (clear b191)
   goals met: 3 of 13
26. (putdown b196)
   deleted: (holding b196)
   added: (clear b196) (arm-empty) (on-table b196)
   goals met: 3 of 13
27. (unstack b191 b222)
   deleted: (on b191 b222) (clear b191) (arm-empty)
   added: (holding b191) (clear b222)
   goals met: 3 of 13
28. (putdown b191)
   deleted: (holding b191)
   added: (clear b191) (arm-empty) (on-table b191)
   goals met: 3 of 13
29. (unstack b222 b135)
   deleted: (on b222 b135) (clear b222) (arm-empty)
   added: (holding b222) (clear b135)
   goals met: 3 of 13
30. (putdown b222)
   deleted: (holding b222)
   added: (clear b222) (arm-empty) (on-table b222)
   goals met: 3 of 13
31. (unstack b135 b11)
   deleted: (on b135 b11) (clear b135) (arm-empty)
   added: (holding b135) (clear b11)
   goals met: 4 of 13
32. (putdown b135)
   deleted: (holding b135)
   added: (clear b135) (arm-empty) (on-table b135)
   goals met: 4 of 13
33. (unstack b77 b156)
   deleted: (on b77 b156) (clear b77) (arm-empty)
   added: (holding b77) (clear b156)
   goals met: 4 of 13
34. (putdown b77)
   deleted: (holding b77)
   added: (clear b77) (arm-empty) (on-table b77)
   goals met: 4 of 13
35. (unstack b156 b193)
   deleted: (on b156 b193) (clear b156) (arm-empty)
   added: (holding b156) (clear b193)
   goals met: 4 of 13
36. (putdown b156)
   deleted: (holding b156)
   added: (clear b156) (arm-empty) (on-table b156)
   goals met: 4 of 13
37. (unstack b193 b184)
   deleted: (on b193 b184) (clear b193) (arm-empty)
   added: (holding b193) (clear b184)
   goals met: 4 of 13
38. (putdown b193)
   deleted: (holding b193)
   added: (clear b193) (arm-empty) (on-table b193)
   goals met: 4 of 13
39. (unstack b184 b308)
   deleted: (on b184 b308) (clear b184) (arm-empty)
   added: (holding b184) (clear b308)
   goals met: 4 of 13
40. (putdown b184)
   deleted: (holding b184)
   added: (clear b184) (arm-empty) (on-table b184)
   goals met: 4 of 13
41. (unstack b308 b224)
   deleted: (on b308 b224) (clear b308) (arm-empty)
   added: (holding b308) (clear b224)
   goals met: 4 of 13
42. (putdown b308)
   deleted: (holding b308)
   added: (clear b308) (arm-empty) (on-table b308)
   goals met: 4 of 13
43. (unstack b224 b95)
   deleted: (on b224 b95) (clear b224) (arm-empty)
   added: (holding b224) (clear b95)
   goals met: 4 of 13
44. (putdown b224)
   deleted: (holding b224)
   added: (clear b224) (arm-empty) (on-table b224)
   goals met: 4 of 13
45. (unstack b82 b253)
   deleted: (on b82 b253) (clear b82) (arm-empty)
   added: (holding b82) (clear b253)
   goals met: 4 of 13
46. (putdown b82)
   deleted: (holding b82)
   added: (clear b82) (arm-empty) (on-table b82)
   goals met: 4 of 13
47. (unstack b253 b137)
   deleted: (on b253 b137) (clear b253) (arm-empty)
   added: (holding b253) (clear b137)
   goals met: 4 of 13
48. (putdown b253)
   deleted: (holding b253)
   added: (clear b253) (arm-empty) (on-table b253)
   goals met: 4 of 13
49. (unstack b137 b144)
   deleted: (on b137 b144) (clear b137) (arm-empty)
   added: (holding b137) (clear b144)
   goals met: 4 of 13
50. (putdown b137)
   deleted: (holding b137)
   added: (clear b137) (arm-empty) (on-table b137)
   goals met: 4 of 13
51. (unstack b144 b375)
   deleted: (on b144 b375) (clear b144) (arm-empty)
   added: (holding b144) (clear b375)
   goals met: 4 of 13
52. (putdown b144)
   deleted: (holding b144)
   added: (clear b144) (arm-empty) (on-table b144)
   goals met: 4 of 13
53. (unstack b375 b1)
   deleted: (on b375 b1) (clear b375) (arm-empty)
   added: (holding b375) (clear b1)
   goals met: 4 of 13
54. (putdown b375)
   deleted: (holding b375)
   added: (clear b375) (arm-empty) (on-table b375)
   goals met: 4 of 13
55. (unstack b84 b133)
   deleted: (on b84 b133) (clear b84) (arm-empty)
   added: (holding b84) (clear b133)
   goals met: 4 of 13
56. (putdown b84)
   deleted: (holding b84)
   added: (clear b84) (arm-empty) (on-table b84)
   goals met: 4 of 13
57. (unstack b133 b276)
   deleted: (on b133 b276) (clear b133) (arm-empty)
   added: (holding b133) (clear b276)
   goals met: 4 of 13
58. (putdown b133)
   deleted: (holding b133)
   added: (clear b133) (arm-empty) (on-table b133)
   goals met: 4 of 13
59. (unstack b276 b2)
   deleted: (on b276 b2) (clear b276) (arm-empty)
   added: (holding b276) (clear b2)
   goals met: 4 of 13
60. (putdown b276)
   deleted: (holding b276)
   added: (clear b276) (arm-empty) (on-table b276)
   goals met: 4 of 13
61. (unstack b95 b368)
   deleted: (on b95 b368) (clear b95) (arm-empty)
   added: (holding b95) (clear b368)
   goals met: 4 of 13
62. (putdown b95)
   deleted: (holding b95)
   added: (clear b95) (arm-empty) (on-table b95)
   goals met: 4 of 13
63. (unstack b368 b5)
   deleted: (on b368 b5) (clear b368) (arm-empty)
   added: (holding b368) (clear b5)
   goals met: 4 of 13
64. (putdown b368)
   deleted: (holding b368)
   added: (clear b368) (arm-empty) (on-table b368)
   goals met: 4 of 13
65. (unstack b1 b104)
   deleted: (on b1 b104) (clear b1) (arm-empty)
   added: (holding b1) (clear b104)
   goals met: 4 of 13
66. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 5 of 13
67. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 5 of 13
68. (stack b10 b6)
   deleted: (clear b6) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b6)
   goals met: 6 of 13
69. (unstack b4 b141)
   deleted: (on b4 b141) (clear b4) (arm-empty)
   added: (holding b4) (clear b141)
   goals met: 6 of 13
70. (stack b4 b9)
   deleted: (clear b9) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b9)
   goals met: 7 of 13
71. (unstack b5 b31)
   deleted: (on b5 b31) (clear b5) (arm-empty)
   added: (holding b5) (clear b31)
   goals met: 7 of 13
72. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 8 of 13
73. (unstack b8 b269)
   deleted: (on b8 b269) (clear b8) (arm-empty)
   added: (holding b8) (clear b269)
   goals met: 8 of 13
74. (stack b8 b10)
   deleted: (clear b10) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b10)
   goals met: 9 of 13
75. (unstack b11 b90)
   deleted: (on b11 b90) (clear b11) (arm-empty)
   added: (holding b11) (clear b90)
   goals met: 8 of 13
76. (stack b11 b5)
   deleted: (clear b5) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b5)
   goals met: 10 of 13
77. (unstack b7 b252)
   deleted: (on b7 b252) (clear b7) (arm-empty)
   added: (holding b7) (clear b252)
   goals met: 9 of 13
78. (stack b7 b3)
   deleted: (clear b3) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b3)
   goals met: 11 of 13
79. (unstack b8 b10)
   deleted: (on b8 b10) (clear b8) (arm-empty)
   added: (holding b8) (clear b10)
   goals met: 10 of 13
80. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 10 of 13
81. (unstack b10 b6)
   deleted: (on b10 b6) (clear b10) (arm-empty)
   added: (holding b10) (clear b6)
   goals met: 9 of 13
82. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 9 of 13
83. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 9 of 13
84. (stack b6 b4)
   deleted: (clear b4) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b4)
   goals met: 10 of 13
85. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 10 of 13
86. (stack b10 b6)
   deleted: (clear b6) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b6)
   goals met: 11 of 13
87. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 11 of 13
88. (stack b8 b10)
   deleted: (clear b10) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b10)
   goals met: 12 of 13
89. (unstack b11 b5)
   deleted: (on b11 b5) (clear b11) (arm-empty)
   added: (holding b11) (clear b5)
   goals met: 10 of 13
90. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 11 of 13
91. (unstack b5 b1)
   deleted: (on b5 b1) (clear b5) (arm-empty)
   added: (holding b5) (clear b1)
   goals met: 10 of 13
92. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 10 of 13
93. (unstack b1 b2)
   deleted: (on b1 b2) (clear b1) (arm-empty)
   added: (holding b1) (clear b2)
   goals met: 9 of 13
94. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 9 of 13
95. (unstack b2 b372)
   deleted: (on b2 b372) (clear b2) (arm-empty)
   added: (holding b2) (clear b372)
   goals met: 9 of 13
96. (stack b2 b8)
   deleted: (clear b8) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b8)
   goals met: 10 of 13
97. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 10 of 13
98. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 11 of 13
99. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 11 of 13
100. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 12 of 13
101. (pickup b11)
   deleted: (clear b11) (on-table b11) (arm-empty)
   added: (holding b11)
   goals met: 11 of 13
102. (stack b11 b5)
   deleted: (clear b5) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b5)
   goals met: 13 of 13
